[
    {
        "code": "overview",
        "slug": "overview",
        "heading": "Overview",
        "description": "CSS Grid is a powerful layout system that allows you to create complex grid-based layouts in a very straightforward and efficient manner. It's a part of the CSS specification that enables you to divide a webpage into rows and columns, and then place content within those areas.",
        "content": [
            {
                "code": "overview",
                "description": "To create a grid, you'll typically set the display property of the grid container to grid.",
                "outputHeight": 160,
                "outputMinWidth": 0
            }
        ]
    },
    {
        "code": "inline-grid",
        "slug": "inline-grid",
        "heading": "Inline grid",
        "description": "The inline-grid value for the display property in CSS allows you to create a grid layout where the container behaves like an inline-level element, similar to inline elements like <span>.",
        "content": [
            {
                "code": "inline-grid",
                "outputHeight": 180,
                "outputMinWidth": 0
            }
        ]
    },
    {
        "code": "rows-and-columns",
        "slug": "rows-and-columns",
        "heading": "Rows and Columns",
        "description": "You can define the size of rows and columns using various units like pixels, percentages, or fractions.",
        "content": [
            {
                "code": "rows",
                "heading": "Rows",
                "description": "Rows in CSS Grid are horizontal tracks that run along the vertical axis of the grid. They define the vertical space in which grid items are placed. Each row can have a specific height, or it can adjust its height dynamically based on the content or available space.",
                "outputMinWidth": 0
            },
            {
                "code": "columns",
                "heading": "Columns",
                "description": "Columns in CSS Grid are vertical tracks that run along the horizontal axis of the grid. They define the horizontal space in which grid items are placed. Each column can have a specific width, or it can adjust its width dynamically based on the content or available space.",
                "editorHeight": 400,
                "outputMinWidth": 1100
            },
            {
                "code": "fr-unit-column",
                "heading": "Fr unit",
                "description": "The fr unit in CSS Grid layout stands for \"fractional unit\" and is used to distribute available space proportionally among grid tracks (rows or columns). Grid layout behaves like a ratio between items",
                "editorHeight": 500
            },
            {
                "code": "fr-unit-row",
                "outputHeight": 280,
                "outputMinWidth": 0
            },
            {
                "code": "repeat",
                "heading": "Repeat",
                "description": "The repeat() function in CSS is not exclusive to grid layouts. While it is commonly used with CSS Grid to create repeated patterns of rows and columns",
                "outputHeight": 280,
                "outputMinWidth": 0
            }
        ]
    }
]